NakIwan/Training_PSoC_6/ch04_ex01_ble_notify_multipleSensor/main.c
#include "cybsp.h"
#include "cyhal.h"
#include "cy_retarget_io.h"

/* Library for malloc and free */
#include "stdlib.h"

/* FreeRTOS */
#include <FreeRTOS.h>
#include <task.h>

/* btstack */
#include "wiced_bt_stack.h"

/* App utilities */
#include "app_bt_utils.h"

/* Header files from BT configurator */
#include "cycfg_bt_settings.h"
#include "cycfg_gap.h"
#include "cycfg_gatt_db.h"
#include "BMP180.h"

/*******************************************************************
 * Macros to assist development of the exercises
 ******************************************************************/

#define TASK_STACK_SIZE (1024u)
#define	TASK_PRIORITY 	(5u)

#define GPIO_INTERRUPT_PRIORITY 7U
#define PORT_INTR_MASK  (0x00000001UL << 0U) //Address port

/* Typdef for function used to free allocated buffer to stack */
typedef void (*pfn_free_buffer_t)(uint8_t *);

/*******************************************************************
 * Function Prototypes
 ******************************************************************/
/* Callback function for Bluetooth stack management type events */
static wiced_bt_dev_status_t app_bt_management_callback             (wiced_bt_management_evt_t event, wiced_bt_management_evt_data_t *p_event_data);

/* GATT Event Callback and Handler Functions */
static wiced_bt_gatt_status_t app_bt_gatt_event_callback            (wiced_bt_gatt_evt_t event, wiced_bt_gatt_event_data_t *p_event_data);

static wiced_bt_gatt_status_t app_bt_connect_event_handler          (wiced_bt_gatt_connection_status_t *p_conn_status);
static wiced_bt_gatt_status_t app_bt_server_event_handler           (wiced_bt_gatt_event_data_t *p_data);

static wiced_bt_gatt_status_t app_bt_write_handler                  (wiced_bt_gatt_event_data_t *p_data);
static wiced_bt_gatt_status_t app_bt_gatt_req_read_handler          (uint16_t conn_id, wiced_bt_gatt_opcode_t opcode,
                                                                    wiced_bt_gatt_read_t *p_read_req, uint16_t len_requested);
static wiced_bt_gatt_status_t app_bt_gatt_req_read_multi_handler    (uint16_t conn_id, wiced_bt_gatt_opcode_t opcode,
                                                                    wiced_bt_gatt_read_multiple_req_t *p_read_req, uint16_t len_requested);
static wiced_bt_gatt_status_t app_bt_gatt_req_read_by_type_handler  (uint16_t conn_id, wiced_bt_gatt_opcode_t opcode,
                                                                    wiced_bt_gatt_read_by_type_t *p_read_req, uint16_t len_requested);

/* Helper functions to find GATT database handles and allocate/free buffers for GATT operations */
static gatt_db_lookup_table_t 	*app_bt_find_by_handle(uint16_t handle);
static uint8_t 					*app_bt_alloc_buffer(uint16_t len);
static void 					app_bt_free_buffer(uint8_t *p_data);

/*******************************************************************
 * Global/Static Variables
 ******************************************************************/

/* Enable RTOS aware debugging in OpenOCD */

volatile int uxTopUsedPriority;

uint8_t button_notify = 0;
uint8_t rx_buf[32];

uint16_t dataRead;
uint16_t connection_id = 0;

uint32_t rx_len = 32;

float press,tp;

TaskHandle_t NotifyTaskHandle = NULL;
TaskHandle_t NotifyTaskHandle1 = NULL;
TaskHandle_t NotifyTaskHandle2 = NULL;

cy_stc_scb_uart_context_t UART_context;
cy_stc_scb_i2c_context_t i2cContext;

extern bmp180_obj bmp180;

void scaning_i2c()
{
	for(uint8_t i=1; i<0x7f; i++)
	{
		if( Cy_SCB_I2C_MasterSendStart(i2c_HW, i, CY_SCB_I2C_WRITE_XFER, 10UL, &i2cContext) == CY_SCB_I2C_SUCCESS )
		printf(" found device on address: 0x%x \r\n", i);
		Cy_SCB_I2C_MasterSendStop(i2c_HW, 10UL, &i2cContext);
	}
}

uint32_t bmp_write_bytes(uint8_t addr, uint8_t *data, uint8_t dataLen, uint32_t timeout)
{
	cy_en_scb_i2c_status_t status=0;
	if( Cy_SCB_I2C_MasterSendStart(i2c_HW, (uint32_t)addr, CY_SCB_I2C_WRITE_XFER, timeout, &i2cContext) == CY_SCB_I2C_SUCCESS )
		{
			for(uint8_t i = 0; i<dataLen; i++)
			status |= Cy_SCB_I2C_MasterWriteByte (i2c_HW, data[i], timeout,&i2cContext);
		}
	status = Cy_SCB_I2C_MasterSendStop(i2c_HW, 10UL, &i2cContext);
	return (uint32_t)status;
}

uint32_t bmp_read_bytes(uint8_t addr, uint8_t reg, uint8_t *val, uint8_t dataLen, uint32_t timeout)
{
	cy_en_scb_i2c_status_t status=0;
	if( Cy_SCB_I2C_MasterSendStart(i2c_HW, (uint32_t)addr, CY_SCB_I2C_WRITE_XFER, timeout, &i2cContext) == CY_SCB_I2C_SUCCESS )
		{
		if( CY_SCB_I2C_SUCCESS == Cy_SCB_I2C_MasterWriteByte (i2c_HW, reg, timeout,&i2cContext) )
			{
				Cy_SCB_I2C_MasterSendReStart(i2c_HW, (uint32_t)addr, CY_SCB_I2C_READ_XFER, timeout, &i2cContext);
				for( uint8_t i = 0; i< dataLen-1; i++)
					Cy_SCB_I2C_MasterReadByte (i2c_HW, CY_SCB_I2C_ACK, val++, timeout, &i2cContext);
					Cy_SCB_I2C_MasterReadByte (i2c_HW, CY_SCB_I2C_NAK, val, timeout, &i2cContext);
			}
		}
	status = Cy_SCB_I2C_MasterSendStop(i2c_HW, 10UL, &i2cContext);
	return (uint32_t)status;
}

void Interrupt_Handler(void){
	// Get interrupt cause
	uint32_t intrSrc = Cy_GPIO_GetInterruptCause0();
	/* Check if the interrupt was from the button's port */
	if(PORT_INTR_MASK == (intrSrc & PORT_INTR_MASK)){
		/* Clear the interrupt */
		Cy_GPIO_ClearInterrupt(P0_4_PORT, P0_4_NUM);

		BaseType_t xHigherPriorityTaskWoken = pdFALSE;

		/* Increment button counter */
		if( app_psoc_button_count_client_char_config[0] & GATT_CLIENT_CONFIG_NOTIFICATION )
		app_psoc_button_count[0]++;

		else if( app_psoc_button_count_2_client_char_config[0] & GATT_CLIENT_CONFIG_NOTIFICATION )
		app_psoc_button_count[0]--;

		/* Notify the counter task that the button was pressed */
		vTaskNotifyGiveFromISR( NotifyTaskHandle, &xHigherPriorityTaskWoken );

		portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
	}
}

static void BMP180_task(void * arg){
	char buffer_text[40];
	while(true)
	{
		bmp180.readValue(&tp, &press, 100);
		printf("Temp : %0.2f \tPress : %0.2f \r\n", tp, press);

		if(app_psoc_bmp180_client_char_config[0] & GATT_CLIENT_CONFIG_NOTIFICATION){
			sprintf(buffer_text,"Temp : %0.2f \t Press : %0.2f",tp,press);
			wiced_bt_gatt_server_send_notification( connection_id,
													HDLC_PSOC_BMP180_VALUE,
													strlen(buffer_text),
													(uint8_t *)buffer_text,
													NULL);
		}
		vTaskDelay(250);
	}
}

