NakIwan/Training_PSoC_6/ch04_ex01_ble_notify_multipleSensor/main.c
static void US100_task(void * arg){
	char buffer_text[24];
	while(true)
	{
    		uint8_t cmd = 0X55;
    				Cy_SCB_UART_PutArrayBlocking(UART_HW, &cmd, 1);
	        		Cy_SCB_UART_GetArrayBlocking(UART_HW, rx_buf, 2);
	        		dataRead = (uint16_t)rx_buf[0] << 8 | rx_buf[1];
	                printf("US100 = %d\r\n\n",dataRead);

		if (connection_id)
		{
			if( app_psoc_us100_client_char_config[0] & GATT_CLIENT_CONFIG_NOTIFICATION )
			{
				sprintf(buffer_text,"US100 = %d", dataRead);
				wiced_bt_gatt_server_send_notification( connection_id,
														HDLC_PSOC_US100_VALUE,
														strlen(buffer_text),
														(uint8_t *)buffer_text,
														NULL);
			}
		}
		vTaskDelay(250);
	}
}

static void notify_task(void * arg)
{
	/* Notification values received from ISR */
	uint32_t ulNotificationValue;
	char buffer_text[24];
	while(true)
	{
		/* Wait for the button ISR */
		ulNotificationValue = ulTaskNotifyTake(pdFALSE, portMAX_DELAY);
		if (ulNotificationValue == 1)
		{
			if( connection_id ) /* Check if we have an active connection */
			{
				/* Check to see if the client has asked for notifications */
				if( app_psoc_button_count_client_char_config[0] & GATT_CLIENT_CONFIG_NOTIFICATION )
				{
					printf( "Notify button press count: (%d)\n",
					app_psoc_button_count[0] );
					sprintf(buffer_text,"Button Count = %d",app_psoc_button_count[0]);
					wiced_bt_gatt_server_send_notification( connection_id,
															HDLC_PSOC_BUTTON_COUNT_VALUE,
															strlen(buffer_text),
															(uint8_t *)buffer_text,
															NULL);
				}
				if( app_psoc_button_count_2_client_char_config[0] & GATT_CLIENT_CONFIG_NOTIFICATION )
				{
					printf( "Notify button press count: (%d)\n",
					app_psoc_button_count[0] );
					sprintf(buffer_text,"Button Count = %d",app_psoc_button_count[0]);
					wiced_bt_gatt_server_send_notification( connection_id,
															HDLC_PSOC_BUTTON_COUNT_2_VALUE,
															strlen(buffer_text),
															(uint8_t *)buffer_text,
															NULL);
				}
			}
		}
	vTaskDelay(250);
	}
}

int main(void)
{
    cy_rslt_t result ;

    /* Initialize the board support package */
    result = cybsp_init() ;
    if (result != CY_RSLT_SUCCESS)
    {
        CY_ASSERT(0);
    }

    /* Enable global interrupts */
    __enable_irq();

    /* Initialize retarget-io to use the debug UART port */
    cy_retarget_io_init(CYBSP_DEBUG_UART_TX, CYBSP_DEBUG_UART_RX, CY_RETARGET_IO_BAUDRATE);

    // Initialize pin P0.4
    result = Cy_GPIO_Pin_Init(P0_4_PORT, P0_4_NUM, &CYBSP_SW2_config);
    if(result != CY_RSLT_SUCCESS)
    {
 	   CY_ASSERT(0);
    }

    result = Cy_GPIO_Pin_Init(P7_1_PORT, P7_1_NUM, &CYBSP_LED4_config);
    if(result != CY_RSLT_SUCCESS)
    {
    	   CY_ASSERT(0);
    }

    cy_stc_sysint_t intrCfg =
    {
    .intrSrc = ioss_interrupts_gpio_0_IRQn,
    .intrPriority = GPIO_INTERRUPT_PRIORITY
    };

    Cy_SysInt_Init(&intrCfg, &Interrupt_Handler);
    NVIC_EnableIRQ(intrCfg.intrSrc);

    printf("**********Application Start*****************\n");

    /* Configure platform specific settings for the BT device */
    cybt_platform_config_init(&cybsp_bt_platform_cfg);

    /* Initialize stack and register the callback function */
    wiced_bt_stack_init (app_bt_management_callback, &wiced_bt_cfg_settings);

    // Initialize the TCPWM block
	Cy_TCPWM_PWM_Init(pwm_HW, pwm_NUM, &pwm_config);
	// Enable the TCPWM block
	Cy_TCPWM_PWM_Enable(pwm_HW, pwm_NUM);
	// Start the PWM
	Cy_TCPWM_TriggerReloadOrIndex(pwm_HW, pwm_MASK);

     result = Cy_SCB_UART_Init(UART_HW, &UART_config, &UART_context);
     if(result == CY_RSLT_SUCCESS)printf("Success initialization UART US100\r\n\n");
     Cy_SCB_UART_Enable(UART_HW);

 	if( Cy_SCB_I2C_Init(i2c_HW, &i2c_config, &i2cContext) == CY_SCB_I2C_SUCCESS )
 		{
 			printf("I2C success \r\n");
 			Cy_SCB_I2C_Enable(i2c_HW);
 		}

 	scaning_i2c();

 	if( bmp180.init(BMP180_MODE_STANDARD, BMP180_ADDR, bmp_read_bytes, bmp_write_bytes) == BMP180_SUCCESS )
 		printf("Device Found !\r\n");

    xTaskCreate (notify_task, "NotifyTask", TASK_STACK_SIZE, NULL, TASK_PRIORITY, &NotifyTaskHandle);
    xTaskCreate (US100_task, "US100Task", TASK_STACK_SIZE, NULL, TASK_PRIORITY-1, &NotifyTaskHandle1);
    xTaskCreate (BMP180_task, "BMP180Task", TASK_STACK_SIZE, NULL, TASK_PRIORITY-2, &NotifyTaskHandle2);

    /* Start the FreeRTOS scheduler */
    vTaskStartScheduler() ;

    /* Should never get here */
    CY_ASSERT(0) ;
}

/*******************************************************************************
* Function Name: wiced_bt_dev_status_t app_bt_management_callback(
* 					wiced_bt_management_evt_t event,
* 					wiced_bt_management_evt_data_t *p_event_data )
********************************************************************************/
static wiced_result_t app_bt_management_callback( wiced_bt_management_evt_t event, wiced_bt_management_evt_data_t *p_event_data )
{
	/* Start in error state so that any unimplemented states will return error */
    wiced_result_t result = WICED_BT_ERROR;
    wiced_bt_device_address_t bda = {0};

    printf("Bluetooth Management Event: 0x%x %s\n", event, get_bt_event_name(event));

    switch( event )
    {
		case BTM_ENABLED_EVT:								// Bluetooth Controller and Host Stack Enabled
			if( WICED_BT_SUCCESS == p_event_data->enabled.status )
			{
				printf( "Bluetooth Enabled\n" );

				/* Set the local BDA from the value in the configurator */
				wiced_bt_set_local_bdaddr((uint8_t *)cy_bt_device_address, BLE_ADDR_PUBLIC);
				wiced_bt_dev_read_local_addr( bda );
				printf( "Local Bluetooth® Device Address: ");
				print_bd_address(bda);

				/*Register GATT callback and initialize database*/
				wiced_bt_gatt_register( app_bt_gatt_event_callback );
				wiced_bt_gatt_db_init( gatt_database, gatt_database_len, NULL );

				/*Disable pairing */
				wiced_bt_set_pairable_mode( WICED_TRUE, WICED_FALSE );

				/* Set advertisement packet and begin advertising */
				wiced_bt_ble_set_raw_advertisement_data(CY_BT_ADV_PACKET_DATA_SIZE,
				cy_bt_adv_packet_data);

				wiced_bt_start_advertisements( BTM_BLE_ADVERT_UNDIRECTED_HIGH, 0, NULL );

